tap "eth-p/software"
tap "homebrew/bundle"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Generic machine emulator and virtualizer
brew "qemu"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Video communication and virtual meeting platform
cask "zoom"
mas "Hotspot Shield", id: 771076721
mas "Notability", id: 360593530
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
